[
  {
    "id": 2,
    "year": "Feb 2026",
    "title": "Algorithmic Portfolio Management",
    "slug": "daily-algorithmic-trading-portfolio",
    "description": "A daily serverless portfolio of 10 algorithms, each at 10% weight, with strong long-term returns and better drawdown control than just holding the S&P 500.",
    "statsReportPath": "/total_strategy.quantstats.html",
    "paragraphs": [
      "Rule #1 for me is simple: do not blow up. As a software engineer who recently started diving into algo trading, what people have told me is that a lot of retail algo portfolios quietly fail because they lean heavily on the same high-beta tech idea and assume trends will always continue. This version is built around running multiple different algorithms together so performance is not tied to one signal style.",
      "Over the last 6 months, I have extesnsively learned, researched, backtested and built my own trading infrastructure. Building these algorithms in the beginning was a massive headache as my lack of experience led to algorithms that were biased, overfit, and unprofitable backtests, but online communities and AI tools helped me pinpoint the mistakes I was making.",
      "My trading infrastucture is serverless on AWS. Every day at 3:50 PM ET, SES sends me what traded and the allocation snapshot before the close. Each algorithm stays at a fixed 10% weight, and I rotate based on each model's signal. On their own, some algorithms have much worse drawdowns and lower Sharpe than the combined portfolio. The main edge is that they are not too correlated, so the overall system holds up better across different regimes.",
      "The algo I'm sharing is most likely overfit, as it is extremely unlikely to achieve these results with no meaningful live testing data to back up the claims. That said, the backtest is long (12+ years), several of these algorithms have strong community history, and not all of them were developed by me. OOS starts in January 2026 and I currently have under 2 months of paper-trading history. I recently put real money into the algo and plan on sharing what happens in the next few months."
    ],
    "closingObservation": "From what I have seen over the full backtest (including pre-2020 years), this portfolio tends to work best when markets change direction quickly and volatility jumps. During the long 2012-2017 bull run, the portfolio benefited from the positive trend, while defensive algorithms helped during pullbacks. The portfolio handled 2018 well, even though the market was unprofitable overall and very choppy. It then handled major shocks like COVID in 2020 and the 2022 rate-hike regime especially well. The biggest weakness of this approach is choppy, mean-reverting markets. The portfolio is designed to do best when regimes flip cleanly (fast bull/bear transitions) or when trends persist. Early 2012 was neither: equities were choppy, bonds were volatile, and volatility spiked and mean-reverted several times, resulting in the biggest drawdown of the algorithm. More recently, in 2024-2026, markets have been more sideways and mean-reverting, which hurts trend-based algorithms, but diversification across other algorithms (especially gold) helped overall performance. With that said, the portfolio has outperformed the S&P 500 in every year of the backtest.",
    "strategyOverview": [
      {
        "title": "Strat 1: Equity Regime + Dip Buyer",
        "backtestStart": "2 Mar, 2012",
        "cagr": "50.42%",
        "sharpe": "1.48",
        "maxDrawdown": "-25.92%",
        "description": "This algo is my dip-catcher. Most of the time it sits in bonds or cash-like exposure, then buys leveraged equity when the market pulls back and the setup still looks healthy. If conditions get stretched or messy, it goes back to defense."
      },
      {
        "title": "Strat 2: Tech Beta with Defensive Fallback",
        "backtestStart": "2 Mar, 2012",
        "cagr": "176.59%",
        "sharpe": "2.38",
        "maxDrawdown": "-40.21%",
        "description": "This algorithm leans into tech when trend and macro conditions are favorable. If those conditions weaken, it rotates into bonds or other defensive assets. The idea is to participate in strong tech runs without being permanently stuck in full beta."
      },
      {
        "title": "Strat 3: Sector Momentum with Crash Overlay",
        "modelName": "Four Corners",
        "backtestStart": "5 Oct, 2011",
        "cagr": "169.54%",
        "sharpe": "2.47",
        "maxDrawdown": "-36.99%",
        "description": "This algo rotates into the sectors with the best relative strength and momentum. Instead of owning everything equally, it follows leadership. When leadership breaks down or the market turns weak, it shifts more defensive."
      },
 {
   "title": "Strat 4: Volatility State Machine",
   "modelName": "HWRT 3",
   "backtestStart": "2 Mar, 2012",
   "cagr": "193.82%",
   "sharpe": "3.00",
   "maxDrawdown": "-25.26%",
   "description": "This is my volatility regime engine. It treats markets as calm, stressed, or crisis. In calm markets it behaves more carry/risk-on, and as stress builds it rotates harder into convex vol exposure. In crisis mode it focuses on protecting capital first."
 },
 {
   "title": "Strat 5: Overbought Volatility Hedge Ladder",
   "modelName": "Better KMLM",
   "backtestStart": "5 Oct, 2011",
   "cagr": "127.91%",
   "sharpe": "1.71",
   "maxDrawdown": "-52.93%",
   "description": "This algo is mostly insurance. It watches for overextended equity conditions and gradually builds volatility hedges. It can drag during smooth bull runs, but it is there to help when markets snap lower."
 },
 {
   "title": "Strat 6: Cross-Asset Trend Risk Switch",
   "modelName": "Bonds Zoop V0.0",
   "backtestStart": "5 Jan, 2011",
   "cagr": "112.86%",
   "sharpe": "1.95",
   "maxDrawdown": "-37.42%",
   "description": "This algorithm uses bond trends as a macro risk signal. If bonds and liquidity look supportive, it allows more equity risk. If they signal stress or tightening, it rotates toward safer exposure."
 },
      {
        "title": "Strat 7: Emerging Markets Directional Trader (Tactical)",
        "modelName": "EM Emerging Markets V0.4",
        "backtestStart": "31 Dec, 2008",
        "cagr": "129.93%",
        "sharpe": "1.63",
        "maxDrawdown": "-66.24%",
        "description": "This is the more tactical EM model. It combines trend filters with short-term overbought/oversold signals to catch sharp EM swings. Upside can be strong, but so can drawdowns."
      },
      {
        "title": "Strat 8: Emerging Markets Trend Follower (Variant)",
        "modelName": "EM ftlt",
        "backtestStart": "31 Dec, 2008",
        "cagr": "146.97%",
        "sharpe": "1.71",
        "maxDrawdown": "-72.24%",
        "description": "This is a second EM model that is less tactical and more trend-following. I run both on purpose with different signals so I can capture EM moves in different ways, even though they can struggle together in bad EM regimes."
      },
      {
        "title": "Strat 9: Rates Trend with Convex Hedge",
        "modelName": "QQQ FTLT Bonds V0.5",
        "backtestStart": "2 Mar, 2012",
        "cagr": "206.86%",
        "sharpe": "2.65",
        "maxDrawdown": "-33.85%",
        "description": "This algo rotates between growth equities and bond duration depending on trend and regime signals. It tends to do best when rate cycles are clear and helps diversify away from pure equity behavior."
      },
      {
        "title": "Strat 10: Gold Trend with Blow-Off Reversal",
        "modelName": "Gold V0.0",
        "backtestStart": "4 Dec, 2008",
        "cagr": "21.43%",
        "sharpe": "0.70",
        "maxDrawdown": "-75.93%",
        "description": "This is my gold trend/hedge model. It follows sustained gold trends and can take contrarian setups when moves get extreme. It is volatile, but recently it has helped a lot while equities have been choppy."
      }
    ]
  }
 ]
 
 
 
 
 
 
 
